/**
  ******************************************************************************
  * @file    System/Delay.h
  * @brief   软件延时库头文件
  * @version V1.0
  * @date    2026-09-20
  ******************************************************************************
  * @history
  *   V1.0  2026-09-20  首次发布(注释规范化)
  ******************************************************************************
  */
#ifndef __DELAY_H
#define __DELAY_H
#include "stdint.h"
void Delay_us(uint32_t us);
void Delay_ms(uint32_t ms);
void Delay_s(uint32_t s);

#endif
